#include "stdafx.h"
#include "ioex.h"
#include "msxml2.h"
#include "command.h"
#include "action.h"
#include "time.h"
#include "afxtempl.h"
#include "algorithm.h"


#import "MSXML2.dll" 
using namespace MSXML2;

extern CString sAppPath;

/*************************************************************************************************************/
//size of each reg in node or master board 
/*************************************************************************************************************/
// addr(u8), board_id(u8), baudrate(u8), Poise_Weight_gram[5](u16)
// cs_poise[5](u16), cs_zero(u16),  target_weight(u16), offset_up(u16)
// cs_Filter_option(u8), cs_gain_wordrate(u8), motor_speed(u8), magnet_freq(u8),magnet_amp(u8), magnet_time(u16)
// delay_f(u8), delay_w(u8), delay_s(u8),open_s(u8), open_w(u8)
// check_sum(u8), rom_para_valid(u8),backup_addr(u8),backup_board(u8)
// cs_mtrl(u16), Mtrl_Weight_gram(u16), Mtrl_Weight_decimal(u8),status(u8), cs_status(u8), hw_status(u8)
// cs_sys_gain_cal_data(u32), s_sys_offset_cal_data(u32), old_cs_zero(u16),NumOfDataToBePgmed(u8),flag_reset(u8)
// flag_enable(u8),flag_disable(u8),flag_release(u8), flag_goon(u8),test_mode_reg1(u8), test_mode_reg2(u8)
// mode(u8),phase(u8),motor_pulse_num(u8),magnet_pulsenum(u32), magnet_halfcycle(u16)
const u8	node_reg_size[] = 
{8,8,8,16,16,16,16,16,\
16,16,16,16,16,16,16,16, \
8,8,8,8,8,16,\
8,8,8,8,8, \
8,8,8,8,\
16,16,8,8,8,8,\
32,32,16,8,8,\
8,8,8,8,8,8,\
8,8,8,32,16};

/********************************************************************************************************************/
// "sys_reg_size" should be consistent with structure "SYSTEM_BOARD"defined in "ioex.h"
/* typedef struct
{ //status from pc
	u16 gw_target[MAX_VIBR_NUM];//0
	u16 gw_uvar[MAX_VIBR_NUM];  //8
	u16 gw_dvar[MAX_VIBR_NUM];  //16
	u8  flag_goon[MAX_VIBR_NUM];//24
	u8  node_num;               //28  // how many weight node in this system
	u8  vibrator_num;           //29  // number of Vibrator detected in the system
	u8  running[MAX_VIBR_NUM];  //30
	u8  flag_start_machine[MAX_VIBR_NUM]; //34   Set when starting machine command is received.
	u8  flag_stop_machine[MAX_VIBR_NUM];  //38
	u8  flag_search[MAX_VIBR_NUM];        //42
	u8  flag_report;					  //46
	u8  reserved1;                        //47  -- aligned
	u16 packer_config1;                   //48  -- word aligned
    u16 packer_config2;                   //50      
    u16 reserved2;                        //52
    u16 reserved3;                        //54
}SYSTEM_BOARD;*/

const u8	sys_reg_size[] = {16,16,16,16,\
16,16,16,16,\
16,16,16,16,\
8,8,8,8,\
8,\
8,\
8,8,8,8,\
8,8,8,8,\
8,8,8,8,\
8,8,8,8,\
8,\
8,\
16,16,16,16};

/********************************************************************************************************************/

u8	l2n_map[sizeof(NODE_CONFIG)]; //local address to node address map
u8	n2l_map[sizeof(NODE_CONFIG)]; //node address to local address map
u8	l2s_map[sizeof(SYSTEM_BOARD)];//local address to system address map
u8	s2l_map[sizeof(SYSTEM_BOARD)];//system address to local address map

u8 *glb_address=0;
u8 glb_hit=0;                 ///indicator 1: get answer from master board 

/*************************************************************************************************************/
// The following 2 global variables are used for data sharing between get_node_reg() and parse_frame()
