#include "define.h"

// define global variables
// 定义全局变量的文件

/*****************************************************************************************/
//              以下带RS485前缀的变量，其值由RS485主控板通过向节点发送帧来赋值的
/*****************************************************************************************/


/*****************************************************************************************/
//                               状态机全局变量
/*****************************************************************************************/

// 状态机全局变量，指示状态机将进入哪一个执行周期（子程序）
   unsigned char next_state = IDLE; 
// 用于通知状态机收到一帧数据
   unsigned char OneFrameReceived = 0; 
// 允许节点启动标志   
   unsigned char Flag2Start = 0x0;
   
/*****************************************************************************************/
//                              步进电机全局变量
/*****************************************************************************************/
   // 定义步进电机的驱动频率选项: 这些数值将被赋给定时器寄存器 TCNT
   // 0xF0: 2.3 cycle/s; 0xF2: 2.6; 0xF4: 3; 0xF5: 3.3; 0xF6: 3.6; 0xF7: 4 cycle/s 
      flash unsigned char Motor_Pulse_Freq[6]={0xF0,0xF2,0xF4,0xF5,0xF6,0xF7}; 
   
   // 电机驱动频率选择：0~5
      unsigned char RS485_Motor_Speed;             // 0~5
   
   // 电机工作模式选择：‘W’启动称量斗，‘S'启动进料斗，
      char RS485_Motor_Working_Mode;               // 'W', 'S', 'B', 'N'


/*****************************************************************************************/
//                              线振机全局变量
/*****************************************************************************************/  

   
   // 线振机驱动频率选择：0~11
      unsigned char RS485_Magnet_Freq;             
   // 线振机振幅选择：0~11      
      unsigned char RS485_Magnet_Amp;              // 0~15
   // 线振机工作时间：单位100ms   
      unsigned int RS485_Magnet_Working_Time;      // n x 100ms   

/******************************************************************************************/
//                              重量测量相关的全局变量
// 重量表示方法：
// 用一个整形数据(16bit)表示重量，为了避免浮点数运算,其中高12bit为整数部分，单位为克
// 低四位为小数部分，单位为1/16克。
/******************************************************************************************/     
   // 节点目标称重量
      unsigned int RS485_Target_Weight;           // see below for format   
   // 节点重量偏差
      unsigned int RS485_W_Offset_Up_Limit;
      unsigned int RS485_W_Offset_Lo_Limit;
   // 砝码重量
      unsigned int RS485_Poise_Weight;
   // 物品重量
      unsigned int Weight_of_Goods;   
  
   // CS5532测量砝码时的输出结果
      unsigned int ConvResult_Poise;
   // 系统零点时CS5532的输出结果
      unsigned int ConvResult_Zero_Weight;
   // 测量货物重量时CS5532的输出结果
      unsigned int ConvResult_Goods;
      
   // 由CS5532输出结果转换成实际重量的计算公式：
   //   Weight_of_Goods       (ConvResult_Zero_Weight - ConvResult_Goods)
   // ------------------  =  ----------------------------------------------
   // RS485_Poise_Weight      (ConvResult_Zero_Weight - ConvResult_Poise)

/******************************************************************************************/  
//                              RS485节点相关变量                             
/******************************************************************************************/  
   // RS485 address
      unsigned char RS485Addr = 0xaa;
   // RS485节点状态   
      unsigned char RS485_Node_Status = 0x0;
   // RS485 Baud Rate
      unsigned char RS485_BaudRate_Index;
      
   // 进料斗延时，单位：20ms
      unsigned char RS485_Delay_F;
   // 称量斗延时，单位：20ms
      unsigned char RS485_Delay_W;
   // 集料斗延时，单位：20ms      
      unsigned char RS485_Delay_C;   

